In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name": ["mayur", "rohan", "alex", "rolex"],
    "marks": [56, 45, 85, 11],
    "city": ["rewari", "alwar", "jaipur", "usa"]
}

df = pd.DataFrame(dict1)
print(df)

    name  marks    city
0  mayur     56  rewari
1  rohan     45   alwar
2   alex     85  jaipur
3  rolex     11     usa

In [3]:
df.to_csv("friends.csv")
df.to_csv("friends2.csv", index = False)

In [4]:
df.head(2)

    name  marks    city
0  mayur     56  rewari
1  rohan     45   alwar

In [5]:
df.tail(2)

    name  marks    city
2   alex     85  jaipur
3  rolex     11     usa

In [6]:
df.describe()

           marks
count   4.000000
mean   49.250000
std    30.576407
min    11.000000
25%    36.500000
50%    50.500000
75%    63.250000
max    85.000000

In [10]:
train = pd.read_csv("train.csv")

In [13]:
train

   train    city  speed
0   1542   alwar     15
1   1521  jaipur     24
2   5452  rewari     84
3   5155     usa     75

In [14]:
train["speed"]

0    15
1    24
2    84
3    75
Name: speed, dtype: int64

In [15]:
train["speed"][0]

np.int64(15)

In [16]:
train["speed"][0] = 1000

C:\Users\soni1\AppData\Local\Temp\ipykernel_6120\1967554247.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train["speed"][0] = 1000

In [17]:
train

   train    city  speed
0   1542   alwar   1000
1   1521  jaipur     24
2   5452  rewari     84
3   5155     usa     75

In [18]:
train.to_csv("train.csv")